#### Terraform Plan 📝`success`

<details><summary>Show Plan</summary>

```

terraform
data.archive_file.trailalerts_cloudtrail_analyzer_zip: Reading...
data.archive_file.trailalerts_event_processor_zip: Reading...
data.archive_file.trailalerts_cloudtrail_analyzer_zip: Read complete after 0s [id=0f82cf1cf889cc423a29461283e8e80356a6a4f4]
data.archive_file.trailalerts_event_processor_zip: Read complete after 0s [id=3e65a8a380d02e7640b87e03c9017360206975b4]
data.aws_s3_bucket.existing_cloudtrail_logs[0]: Reading...
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=401015993915]
data.aws_s3_bucket.existing_cloudtrail_logs[0]: Read complete after 1s [id=cloudtrail-logs-ddr-research]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.sns_topic_policy[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sns_topic_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "lambda.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.sns_topic_policy_role[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sns_topic_policy_role" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # aws_cloudwatch_log_group.trailalerts_cloudtrail_analyzer_log_group will be created
  + resource "aws_cloudwatch_log_group" "trailalerts_cloudtrail_analyzer_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/trailalerts-cloudtrail-analyzer"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Service"     = "TrailAlerts"
        }
    }

  # aws_cloudwatch_log_group.trailalerts_event_processor_log_group will be created
  + resource "aws_cloudwatch_log_group" "trailalerts_event_processor_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/trailalerts-event-processor"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Service"     = "TrailAlerts"
        }
    }

  # aws_dynamodb_table.security_events[0] will be created
  + resource "aws_dynamodb_table" "security_events" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "pk"
      + id               = (known after apply)
      + name             = "trailalerts-security-events"
      + range_key        = "sk"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Service"     = "TrailAlerts"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "eventName"
          + type = "S"
        }
      + attribute {
          + name = "pk"
          + type = "S"
        }
      + attribute {
          + name = "sigmaRuleTitle"
          + type = "S"
        }
      + attribute {
          + name = "sk"
          + type = "S"
        }
      + attribute {
          + name = "sourceType"
          + type = "S"
        }
      + attribute {
          + name = "timestamp"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "eventName"
          + name               = "eventNameIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "timestamp"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
        }
      + global_secondary_index {
          + hash_key           = "sigmaRuleTitle"
          + name               = "sigmaRuleTitleIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "timestamp"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
        }
      + global_secondary_index {
          + hash_key           = "sourceType"
          + name               = "sourceTypeIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "timestamp"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
        }

      + point_in_time_recovery {
          + enabled = true
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = "ttl"
          + enabled        = true
        }
    }

  # aws_iam_role.trailalerts_cloudtrail_analyzer_role will be created
  + resource "aws_iam_role" "trailalerts_cloudtrail_analyzer_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "trailalerts-cloudtrail-analyzer-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Service"     = "TrailAlerts"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.trailalerts_event_processor_role will be created
  + resource "aws_iam_role" "trailalerts_event_processor_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "trailalerts-event-processor-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "TrailAlerts Event Processor Lambda Role"
          + "Service"     = "CloudTrail-Monitoring"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "TrailAlerts Event Processor Lambda Role"
          + "Service"     = "CloudTrail-Monitoring"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.sns_topic_policy[0] will be created
  + resource "aws_iam_role_policy" "sns_topic_policy" {
      + id          = (known after apply)
      + name        = "sns_topic_policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.trailalerts_cloudtrail_analyzer_policy will be created
  + resource "aws_iam_role_policy" "trailalerts_cloudtrail_analyzer_policy" {
      + id          = (known after apply)
      + name        = "trailalerts-cloudtrail-analyzer-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.trailalerts_cloudtrail_analyzer_sqs_policy will be created
  + resource "aws_iam_role_policy" "trailalerts_cloudtrail_analyzer_sqs_policy" {
      + id          = (known after apply)
      + name        = "trailalerts-cloudtrail-analyzer-sqs-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.trailalerts_event_processor_policy will be created
  + resource "aws_iam_role_policy" "trailalerts_event_processor_policy" {
      + id          = (known after apply)
      + name        = "trailalerts-event-processor-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.trailalerts_event_processor_sqs_policy will be created
  + resource "aws_iam_role_policy" "trailalerts_event_processor_sqs_policy" {
      + id          = (known after apply)
      + name        = "trailalerts-event-processor-sqs-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_lambda_event_source_mapping.sqs_to_event_processor will be created
  + resource "aws_lambda_event_source_mapping" "sqs_to_event_processor" {
      + arn                                = (known after apply)
      + batch_size                         = 10
      + enabled                            = true
      + event_source_arn                   = (known after apply)
      + function_arn                       = (known after apply)
      + function_name                      = (known after apply)
      + id                                 = (known after apply)
      + last_modified                      = (known after apply)
      + last_processing_result             = (known after apply)
      + maximum_batching_window_in_seconds = 60
      + maximum_record_age_in_seconds      = (known after apply)
      + maximum_retry_attempts             = (known after apply)
      + parallelization_factor             = (known after apply)
      + state                              = (known after apply)
      + state_transition_reason            = (known after apply)
      + tags_all                           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Service"     = "TrailAlerts"
        }
      + uuid                               = (known after apply)

      + amazon_managed_kafka_event_source_config (known after apply)

      + self_managed_kafka_event_source_config (known after apply)
    }

  # aws_lambda_function.trailalerts_cloudtrail_analyzer will be created
  + resource "aws_lambda_function" "trailalerts_cloudtrail_analyzer" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./TrailAlertsCloudTrailAnalyzer.zip"
      + function_name                  = "trailalerts-cloudtrail-analyzer"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.13"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "ZZIF3YP9fh18urMNOYgwVX7wQDUd+4pJz9XRSWuzUgE="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Service"     = "TrailAlerts"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_function.trailalerts_event_processor will be created
  + resource "aws_lambda_function" "trailalerts_event_processor" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./TrailAlertsEventProcessor.zip"
      + function_name                  = "trailalerts-event-processor"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.13"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "i3yO1bFEs0H0+7Klb8sl0LdLfCGu8NizErXaOIlhWUA="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Service"     = "TrailAlerts"
        }
      + timeout                        = 120
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_layer_version.trailalerts_detection_layer will be created
  + resource "aws_lambda_layer_version" "trailalerts_detection_layer" {
      + arn                         = (known after apply)
      + code_sha256                 = (known after apply)
      + compatible_runtimes         = [
          + "python3.13",
        ]
      + created_date                = (known after apply)
      + description                 = "Layer containing TrailAlerts detection dependencies"
      + filename                    = "../lambdas/layer/layer.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "trailalerts-detection-layer"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = true
      + source_code_hash            = "geZBfqY86uz+roXdSlOVTTfHJAiS9iwcJbfEbKUBCKA="
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # aws_lambda_permission.allow_s3 will be created
  + resource "aws_lambda_permission" "allow_s3" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "trailalerts-cloudtrail-analyzer"
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + source_arn          = "arn:aws:s3:::cloudtrail-logs-ddr-research"
      + statement_id        = "AllowExecutionFromS3Bucket"
      + statement_id_prefix = (known after apply)
    }

  # aws_s3_bucket.trailalerts_rules_bucket will be created
  + resource "aws_s3_bucket" "trailalerts_rules_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "trailalerts-rules-401015993915"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Service"     = "TrailAlerts"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_notification.cloudtrail_logs_notification will be created
  + resource "aws_s3_bucket_notification" "cloudtrail_logs_notification" {
      + bucket      = "cloudtrail-logs-ddr-research"
      + eventbridge = false
      + id          = (known after apply)

      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + id                  = (known after apply)
          + lambda_function_arn = (known after apply)
        }
    }

  # aws_sns_topic.trailalerts_alerts_topic[0] will be created
  + resource "aws_sns_topic" "trailalerts_alerts_topic" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "trailalerts-cloudtrail-alerts"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Service"     = "TrailAlerts"
        }
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_policy.trailalerts_alerts_policy[0] will be created
  + resource "aws_sns_topic_policy" "trailalerts_alerts_policy" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = (known after apply)
    }

  # aws_sns_topic_subscription.email_subscription[0] will be created
  + resource "aws_sns_topic_subscription" "email_subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "jayashwa@gmail.com"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # aws_sqs_queue.trailalerts_alerts_queue will be created
  + resource "aws_sqs_queue" "trailalerts_alerts_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 86400
      + name                              = "trailalerts-alerts-queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags_all                          = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Service"     = "TrailAlerts"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 180
    }

  # null_resource.build_trailalerts_lambda_layer will be created
  + resource "null_resource" "build_trailalerts_lambda_layer" {
      + id       = (known after apply)
      + triggers = {
          + "requirements_sha1" = "dea7e7105a9fb2fb71498278a78225569068ac31"
        }
    }

Plan: 22 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @jayashwaS, Action: `pull_request`*